# config.py

# Токен для Telegram бота
TOKEN = 'YOUR_TELEGRAM_BOT_TOKEN_HERE'

# ID чата или канала для логов
LOGS_ID = 'YOUR_LOGS_CHANNEL_ID_HERE'

# Ссылки на правила и новостной канал
RULES_LINK = 'YOUR_RULES_LINK_HERE'
NEWS_LINK = 'YOUR_NEWS_CHANNEL_LINK_HERE'

# ID канала
CHANNEL_ID = 'YOUR_CHANNEL_ID_HERE'

# Пример других возможных конфигураций
API_KEY = 'YOUR_API_KEY_HERE'
SECRET_KEY = 'YOUR_SECRET_KEY_HERE'

# Настройки логирования
LOGGING_LEVEL = 'INFO'  # Можно установить на 'DEBUG', 'WARNING', 'ERROR', 'CRITICAL'

# Пример конфигурации коэффициентов
COEFFICIENTS = {
    'победа 1': 1.85,
    'победа 2': 1.85,
    'п1': 1.85,
    'п2': 1.85,
    'ничья': 1.9,
    'нечет': 1.85,
    'фут гол': 1.4,
    'фут мимо': 1.4,
    'баскет гол': 1.4,
    'баскет мимо': 1.4,
    'больше': 1.85,
    'меньше': 1.85,
    'чет': 1.85,
    'дартс белое': 1.5,
    'дартс ред': 1.5,
    'дартс мимо': 1.5,
    'дартс центр': 1.5,
    'камень': 1.6,
    'ножницы': 1.6,
    'бумага': 1.6,
    'сектор 1': 1.85,
    'сектор 2': 1.65,
    'сектор 3': 1.5,
    'пвп': 1.9,
    'красное': 1.8,
    'черное': 1.8,
    'зеро': 2,
    'плинко': 1.8,
}

# Пример конфигурации для костей
DICE_CONFIG = {
    'нечет': ("🎲", [1, 3, 5]),
    'баскет гол': ("🏀", [4, 5, 6]),
    'баскет мимо': ("🏀", [1, 2, 3]),
    'больше': ("🎲", [4, 5, 6]),
    'меньше': ("🎲", [1, 2, 3]),
    'чет': ("🎲", [2, 4, 6]),
    'дартс белое': ("🎯", [3, 5]),
    'дартс ред': ("🎯", [2, 4]),
    'дартс мимо': ("🎯", [1]),
    'дартс центр': ("🎯", [6]),
    'сектор 1': ("🎲", [1, 2]),
    'сектор 2': ("🎲", [3, 4]),
    'сектор 3': ("🎲", [3, 4]),
    'плинко': ("🎲", [4, 5, 6]),
    'бумага': ("✋", ['👊']),
    'камень': ("👊", ['✌️']),
    'ножницы': ("✌️", ['✋']),
    'победа 1': ("🎲", [1]),
    'победа 2': ("🎲", [1]),
    'п1': ("🎲", [1]),
    'п2': ("🎲", [1]),
    'ничья': ("🎲", [1]),
    'красное': ("x", ['CAACAgIAAxkBAAEMc65miwstwNiEg2zA8AJbzcIRFqMC1wACa0wAAoogUEqSy15B1lxZkTUE']),
}